ToDo/app/controllers/tasks_controller.rb

  def complete
    @task = Task.find(params.require(:id))
    @task.done!
    @tasks = Task.all
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks"