ToDo/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("text", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "asfas"], ["done", "f"], ["created_at", "2017-08-22 12:07:16.021132"], ["updated_at", "2017-08-22 12:07:16.021132"]]
---
  def create
    @task= Task.new(task_params)
    @task.done = false
    @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "tasks" SET "text" = ?, "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["text", ""], ["done", nil], ["updated_at", "2017-08-22 12:58:20.457747"], ["id", 1]]
---
  def update
    @task = Task.find(params.require(:id))
    @task.done = true
    @task.save