ToDo/app/controllers/tasks_controller.rb

  def update
    @task = Task.find(params.require(:id))
    @task.done!
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"